Зарплата_и_Управление_Персоналом_демо/src/Catalogs/ПакетыДокументовДля1САрхива/ПакетыДокументовДля1САрхива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПакетыДокументовДля1САрхива</name>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>DefinedType.ГрифДоступаБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПередачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Передал</name>
    <type>
      <types>DefinedType.ФизическоеЛицоБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.ПодразделениеБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>Принял</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Создал</name>
    <type>
      <types>DefinedType.ФизическоеЛицоБИА</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбменаСАрхивом</name>
    <type>
      <types>EnumRef.СтатусыОбменаС1САрхивом</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>DefinedType.СотрудникБИА</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.ДокументыБИА</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Зарплата_и_Управление_Персоналом_демо/src/InformationRegisters/СтатусыОбменаДокументовБИА/СтатусыОбменаДокументовБИА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОбменаДокументовБИА</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбменаС1САрхивом</types>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументБИА</name>
    <type>
      <types>CatalogRef.ДокументыБИА</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПакетДокументов</name>
    <type>
      <types>CatalogRef.ПакетыДокументовДля1САрхива</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Зарплата_и_Управление_Персоналом_демо/src/Enums/СтатусыОбменаС1САрхивом/СтатусыОбменаС1САрхивом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбменаС1САрхивом</name>
  <enumValues>
    <name>ВыгрузкаВыполнена</name>
  </enumValues>
  <enumValues>
    <name>ГотовКВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВАрхивВыполнена</name>
  </enumValues>
  <enumValues>
    <name>НеГотовКВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ОбнаруженыОшибкиПриВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ОбнаруженыОшибкиПриЗагрузкеВАрхив</name>
  </enumValues>
  <enumValues>
    <name>ОбнаруженыОшибкиПриПроверкеВАрхиве</name>
  </enumValues>
  <enumValues>
    <name>ПринятВАрхив</name>
  </enumValues>
</mdclass:Enum>

Зарплата_и_Управление_Персоналом_демо/src/Enums/СобытияОбменаС1САрхивом/СобытияОбменаС1САрхивом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СобытияОбменаС1САрхивом</name>
  <enumValues>
    <name>ИзменениеСтатусаОбмена</name>
  </enumValues>
  <enumValues>
    <name>ОтзывДокументаИзАрхива</name>
  </enumValues>
  <enumValues>
    <name>ОтменаОтметкиДокументаКВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ОтметкаДокументаКВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбмена</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>УничтожениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПакетаДокументов</name>
  </enumValues>
</mdclass:Enum>

Зарплата_и_Управление_Персоналом_демо/src/Catalogs/ПакетыДокументовДля1САрхива/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПакетыТабчасть.Документ КАК ДокументВЭтомПакете,
		|	ПакетыТабчасть.Документ КАК ДокументВДругомПакете,
		|	ПакетыТабчасть.Ссылка КАК Пакет
		|ИЗ
		|	Справочник.ПакетыДокументовДля1САрхива.Документы КАК ПакетыТабчасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПакетыДокументовДля1САрхива КАК Пакеты
		|		ПО ПакетыТабчасть.Ссылка = Пакеты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыБИА КАК ДокументыБИА
		|		ПО ПакетыТабчасть.Документ = ДокументыБИА.Ссылка
		|ГДЕ
		|	ПакетыТабчасть.Документ В(&ДокументыПакета)
		|	И ПакетыТабчасть.Ссылка <> &Ссылка
		|	И НЕ Пакеты.ПометкаУдаления
		|	И НЕ ДокументыБИА.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументыЭтогоПакета.Ссылка,
		|	ДокументыДругогоПакета.Ссылка,
		|	ПакетыТабчасть.Ссылка
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыЭтогоПакета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыБИА КАК ДокументыДругогоПакета
		|		ПО ДокументыЭтогоПакета.ОбъектОснование = ДокументыДругогоПакета.ОбъектОснование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПакетыДокументовДля1САрхива.Документы КАК ПакетыТабчасть
		|		ПО ДокументыДругогоПакета.Ссылка = ПакетыТабчасть.Документ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПакетыДокументовДля1САрхива КАК Пакеты
		|		ПО ПакетыТабчасть.Ссылка = Пакеты.Ссылка
		|ГДЕ
		|	ДокументыЭтогоПакета.Ссылка В(&ДокументыПакета)
		|	И НЕ ДокументыДругогоПакета.Ссылка В (&ДокументыПакета)
		|	И ПакетыТабчасть.Ссылка <> &Ссылка
		|	И НЕ Пакеты.ПометкаУдаления
		|	И НЕ ДокументыЭтогоПакета.ПометкаУдаления
		|	И НЕ ДокументыДругогоПакета.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДокументыПакета", Документы.ВыгрузитьКолонку("Документ"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Отказ = Истина
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДокументВЭтомПакете = Выборка.ДокументВДругомПакете Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Документ %1 уже добавлен в %2'"),
				Выборка.ДокументВЭтомПакете, Выборка.Пакет));
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Документ %1 не может быть помещен в этот пакет, т.к. документ %2,
						|созданный на основании того же объекта, добавлен в %3'"),
				Выборка.ДокументВЭтомПакете, Выборка.ДокументВДругомПакете, Выборка.Пакет));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ДатаСоздания = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитовДоИзменения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Ссылка, "СтатусОбменаСАрхивом, ПометкаУдаления");
	ДополнительныеСвойства.Вставить("ЗначенияРеквизитовДоИзменения", ЗначенияРеквизитовДоИзменения);
	
	Если (Не ДополнительныеСвойства.Свойство("ПропуститьПроверкуСтатусаПриЗаписи")
				Или ДополнительныеСвойства.ПропуститьПроверкуСтатусаПриЗаписи <> Истина)
			И ЗначениеЗаполнено(ЗначенияРеквизитовДоИзменения.СтатусОбменаСАрхивом)
			И Не ОбменСАрхивом.ДоступноРедактированиеПоСтатусу(
				ЗначенияРеквизитовДоИзменения.СтатусОбменаСАрхивом, Истина) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Запрещено изменение пакета в статусе ""%1""'"),
			ЗначенияРеквизитовДоИзменения.СтатусОбменаСАрхивом);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
			ДатаСоздания = ТекущаяДатаСеанса();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Создал) Тогда
			Создал = ОбменСАрхивом.ФизЛицоТекущегоПользователя();
		КонецЕсли;
	КонецЕсли;
	
	Если СтатусОбменаСАрхивом = Перечисления.СтатусыОбменаС1САрхивом.ГотовКВыгрузке Тогда
		ДатаПередачи = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитовДоИзменения = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("ЗначенияРеквизитовДоИзменения", ЗначенияРеквизитовДоИзменения) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИзмененаПометка = ПометкаУдаления <> ЗначенияРеквизитовДоИзменения.ПометкаУдаления;
	ИзмененСтатус = ЗначенияРеквизитовДоИзменения.СтатусОбменаСАрхивом <> СтатусОбменаСАрхивом;
	Если Не ПометкаУдаления И (ИзмененСтатус Или ИзмененаПометка) Тогда
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		РегистрыСведений.ИсторияОбменаС1САрхивом.Добавить(Ссылка,
			Перечисления.СобытияОбменаС1САрхивом.ИзменениеСтатусаОбмена,,
			СтатусОбменаСАрхивом, УниверсальноеВремя(ТекущаяДатаСеанса));
		СтатусыДокументовНабор = РегистрыСведений.СтатусыОбменаДокументовБИА.СоздатьНаборЗаписей();
		СтатусыДокументовНабор.Отбор.ПакетДокументов.Установить(Ссылка);
		Для Каждого Стр Из Документы Цикл
			СтатусЗапись = СтатусыДокументовНабор.Добавить();
			СтатусЗапись.ДокументБИА = Стр.Документ;
			СтатусЗапись.ПакетДокументов = Ссылка;
			СтатусЗапись.Статус = СтатусОбменаСАрхивом;
			СтатусЗапись.Дата = ТекущаяДатаСеанса;
		КонецЦикла;
		СтатусыДокументовНабор.Записать();
		Если СтатусОбменаСАрхивом = Перечисления.СтатусыОбменаС1САрхивом.ПринятВАрхив Тогда
			ОбъектыДляОбработки = ОбъектыОснованияПринятыеВАрхив();
			ОбменСАрхивом.УдалитьДанныеДокументовПринятыхВАрхив(ОбъектыДляОбработки);
		КонецЕсли;
	ИначеЕсли ПометкаУдаления И ИзмененаПометка Тогда
		РегистрыСведений.ИсторияОбменаС1САрхивом.Добавить(Ссылка,
			Перечисления.СобытияОбменаС1САрхивом.Прочее, НСтр("ru = 'Пакет помечен на удаление'"));
		СтатусыДокументовНабор = РегистрыСведений.СтатусыОбменаДокументовБИА.СоздатьНаборЗаписей();
		СтатусыДокументовНабор.Отбор.ПакетДокументов.Установить(Ссылка);
		СтатусыДокументовНабор.Записать();
		ОбменСАрхивом.ОтменитьУдалениеДанныхДокументовПринятыхВАрхив(ОбъектыДляОбработки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектыОснованияПринятыеВАрхив() 
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументыБИА.ОбъектОснование КАК ОбъектОснование
		|ПОМЕСТИТЬ ОбъектыВПакетах
		|ИЗ
		|	Справочник.ПакетыДокументовДля1САрхива.Документы КАК ПакетыДокументовДля1САрхиваДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыБИА КАК ДокументыБИА
		|		ПО ПакетыДокументовДля1САрхиваДокументы.Документ = ДокументыБИА.Ссылка
		|ГДЕ
		|	ДокументыБИА.ПометкаУдаления = ЛОЖЬ
		|	И ПакетыДокументовДля1САрхиваДокументы.Документ.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыБИА.Ссылка) КАК Количество,
		|	ДокументыБИА.ОбъектОснование КАК ОбъектОснование
		|ПОМЕСТИТЬ КоличествоВсехДокументовБИА
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыВПакетах КАК ОбъектыВПакетах
		|		ПО ДокументыБИА.ОбъектОснование = ОбъектыВПакетах.ОбъектОснование
		|			И (ДокументыБИА.ПометкаУдаления = ЛОЖЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыБИА.ОбъектОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументыБИАВСтатусе.Ссылка) КАК Количество,
		|	ДокументыБИАВСтатусе.ОбъектОснование КАК ОбъектОснование
		|ПОМЕСТИТЬ КоличествоДокументовБИАВСтатусе
		|ИЗ
		|	Справочник.ДокументыБИА КАК ДокументыБИАВСтатусе
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыВПакетах КАК ОбъектыВПакетах
		|		ПО ДокументыБИАВСтатусе.ОбъектОснование = ОбъектыВПакетах.ОбъектОснование
		|			И (ДокументыБИАВСтатусе.ПометкаУдаления = ЛОЖЬ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбменаДокументовБИА КАК СтатусыОбменаДокументовБИА
		|		ПО (СтатусыОбменаДокументовБИА.ДокументБИА = ДокументыБИАВСтатусе.Ссылка)
		|			И (СтатусыОбменаДокументовБИА.Статус = &Статус)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыБИАВСтатусе.ОбъектОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КоличествоВсехДокументовБИА.ОбъектОснование КАК ОбъектОснование
		|ИЗ
		|	КоличествоВсехДокументовБИА КАК КоличествоВсехДокументовБИА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоДокументовБИАВСтатусе КАК КоличествоДокументовБИАВСтатусе
		|		ПО (КоличествоДокументовБИАВСтатусе.ОбъектОснование = КоличествоВсехДокументовБИА.ОбъектОснование)
		|			И (КоличествоДокументовБИАВСтатусе.Количество = КоличествоВсехДокументовБИА.Количество)";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыОбменаС1САрхивом.ПринятВАрхив);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции	

#КонецОбласти

#КонецЕсли
